import type { LegalBlock } from './LegalDocument';

export const ruPrivacyBlocks: LegalBlock[] = [
  {
    "type": "paragraph",
    "text": "ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ"
  },
  {
    "type": "paragraph",
    "text": "Актуальная редакция: 1 июня 2026 г."
  },
  {
    "type": "paragraph",
    "text": "Настоящая Политика конфиденциальности регламентирует, как и для каких целей MALJOY LTD («мы» или производные формы) обрабатывает ваши персональные данные («Политика») во время использования вами Бота, как определено ниже."
  },
  {
    "type": "paragraph",
    "text": "Мы серьезно относимся к вопросам конфиденциальности и защиты ваших персональных данных. Чтобы обеспечить законную и прозрачную обработку ваших персональных данных, мы разработали настоящую Политику конфиденциальности."
  },
  {
    "type": "paragraph",
    "text": "Кто мы?"
  },
  {
    "type": "paragraph",
    "text": "Мы – компания MALJOY LTD, учрежденная и действующая в соответствии с законодательством Великобритании. Регистрационный номер: 16216055. Юридический адрес: Suite 12 2nd Floor Queens House, 180 Tottenham Court Road, London, United Kingdom, W1T 7PD."
  },
  {
    "type": "paragraph",
    "text": "Мы являемся:"
  },
  {
    "type": "paragraph",
    "text": "контролером ваших персональных данных, то есть мы самостоятельно определяем, как и зачем мы обрабатываем ваши персональные данные («Контролер»);"
  },
  {
    "type": "paragraph",
    "text": "ПОСКОЛЬКУ ДОСТУП К БОТУ ОСУЩЕСТВЛЯЕТСЯ УДАЛЕННО, МЫ МОЖЕМ НЕПРЕДНАМЕРЕННО СОБИРАТЬ ПЕРСОНАЛЬНЫЕ ДАННЫЕ ЛИЦ, НЕ ДОСТИГШИХ 16 ЛЕТ. ЕСЛИ ВЫ ЯВЛЯЕТЕСЬ НЕСОВЕРШЕННОЛЕТНИМ, ПРОСЬБА ВОЗДЕРЖАТЬСЯ ОТ ИСПОЛЬЗОВАНИЯ БОТА И ДОСТУПА К НЕМУ. МЫ СРАЗУ ЖЕ ПОЛНОСТЬЮ УДАЛИМ ВАШИ ДАННЫЕ ПО ВАШЕМУ ЗАПРОСУ ИЛИ ЗАПРОСУ ВАШЕГО ОПЕКУНА."
  },
  {
    "type": "paragraph",
    "text": "2. Определения"
  },
  {
    "type": "paragraph",
    "text": "Бот – анонимный чат под общим названием «Анонимный чат | Общение» (@chatus, @ZnakomstvaAnonimniyChatBot)», представляющий собой приложение, которое работает полностью на базе приложения для мобильных устройств и персональных компьютеров Telegram."
  },
  {
    "type": "paragraph",
    "text": "Пользователь – физическое лицо, которое взаимодействует с ботом через приложение Telegram для доступа к анонимному чату."
  },
  {
    "type": "paragraph",
    "text": "Персональные данные – любая информация, которая может быть использована для идентификации лица, а также любая информация о лице, которое уже идентифицировано."
  },
  {
    "type": "paragraph",
    "text": "GDPR – Регламент (ЕС) 2016/679 Европейского парламента и Совета от 27 апреля 2016 года о защите физических лиц в отношении обработки персональных данных и о свободном обращении таких данных, а также об отмене Директивы 95/46/ЕС."
  },
  {
    "type": "paragraph",
    "text": "Telegram – приложение, известное под названием «Telegram», для мобильных устройств на базе Android и iOS, а также для персональных компьютеров, предоставляющее пользователям функции связи и обмена сообщениями, включая, помимо прочего, Бот и Сервис."
  },
  {
    "type": "paragraph",
    "text": "3. Для каких целей предназначена данная Политика?"
  },
  {
    "type": "paragraph",
    "text": "В настоящей Политике конфиденциальности мы объясняем, какие персональные данные мы собираем и на каком основании мы их обрабатываем, когда Пользователь использует Бот. В ней также изложена иная важная информация о том, как мы обрабатываем персональные данные, о правах Пользователя и о том, как их реализовать."
  },
  {
    "type": "paragraph",
    "text": "4. Для каких целей и какие персональные данные мы обрабатываем?"
  },
  {
    "type": "paragraph",
    "text": "4.1."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Идентификация пользователя Бота"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "Реквизиты Telegram (ID пользователя, имя пользователя, ссылка на профиль)."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Законный интерес: для работы, обслуживания и обеспечения безопасности сервиса (предотвращение злоупотреблений, устранение неполадок, обеспечение функциональности)."
      ],
      [
        "Срок хранения персональных данных",
        "1 год после удаления Бота."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Пользователь не обязан предоставлять нам дополнительные персональные данные. Бот получает необходимые данные от Telegram, когда пользователь активирует Бот."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.2."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Функционал подбора совпадающих пользователей"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "ID пользователя, пол, возраст (необязательно)."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Исполнение договора (Условия Использования): обработка необходима для оказания услуг в соответствии с Условиями Использования, например, для подбора пользователей на основе их предпочтений по полу и/или возрасту."
      ],
      [
        "Срок хранения персональных данных",
        "1 год после удаления Бота."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Указание пола Пользователя является обязательным для работы функции подбора совпадающих пользователей. Если Пользователь решает не предоставлять обязательные данные (пол), он может не иметь возможности использовать функции совпадения пользователей в Боте. Указание возраста Пользователя не является обязательным. Если Пользователь не указывает эту информацию, функции совпадения Пользователей в Боте будут ограничены."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.3."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Подбор пользователей Бота с одинаковыми интересами."
      ],
      [
        "Категории обрабатываемых персональных данных",
        "ID пользователя, информация о личных интересах (закрытый перечнь): финансовая поддержка, ролевые игры, дружба, одиночество, музыка, кино, книги, спорт, мемы, аниме, Корея, домашние животные, технологии, игры, Twitch."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Исполнение договора (Условия Использования): обработка необходима для оказания услуг в соответствии с Условиями Использования, например, для подбора пользователей на основе их предпочтений по интересам."
      ],
      [
        "Срок хранения персональных данных",
        "1 год после удаления Бота."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Указание интересов не является обязательным. Пользователь может выбрать, указывает ли он информацию о своих интересах. Если Пользователь не предоставит эту информацию, функциональность Бота по подбору будет ограничена."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.4."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Идентификация премиум-пользователей и предоставления им доступа к услугам, доступным премиум-пользователям."
      ],
      [
        "Категории обрабатываемых персональных данных",
        "ID пользователя, срок действия членства, сумма оплаты  Telegram-stars."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Исполнение договора (Условия использования): обработка необходима для проверки премиум-членства и предоставления соответствующих услуг."
      ],
      [
        "Срок хранения персональных данных",
        "1 год после удаления Бота."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Поскольку эта информация поступает непосредственно от Telegram, Пользователь не должен предоставлять ее самостоятельно. Данные собираются автоматически в рамках предоставления услуг при взаимодействии Пользователя с Ботом."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.5."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Учет и мониторинг действий пользователей и системы в целях обеспечения безопасности, качества оказания услуг и предотвращения нарушений"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "Данные об действиях Пользователя (created_at, updated_at), технические метаданные (is_media, ip_address, user_agent, log_level), дополнительные диагностические или контекстные данные (context, meta) и т. д.), журналы действий (например, тип действия или название события (start_chat, send_message, report_user), контекст или значение параметра, связанного с действием (значение — может включать ID сообщения, хэш или короткий код, но не полное содержание сообщения), идентификаторы сообщения и маршрутизации (message_id, sended_id) и т. д.)."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Легитимный интерес: обеспечение безопасности Сервиса, изучение пользовательского опыта, предотвращение злоупотреблений и улучшение качества работы Бота."
      ],
      [
        "Срок хранения персональных данных",
        "Данные обрабатываются только в течение периода мониторинга и не хранятся после его завершения."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Пользователь не обязан предоставлять эти данные самостоятельно. Данные собираются Ботом автоматически в ходе работы Сервиса, Пользователь не вправе отказаться от сбора указанных данных."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.6."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Предотвращение мошеннических действий, спама и иной нелегальной деятельности"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "Количество чатов (в день, в месяц, в год и т. д.), продолжительность чата, количество полученных сообщений, последняя активность, содержание чата."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Законный интерес: защита сервиса и пользователей от мошенничества, спама и иной нелегальной деятельности, обеспечение безопасного и надежного взаимодействия Пользователей."
      ],
      [
        "Срок хранения персональных данных",
        "Сообщения в чате, в которых не обнаружено запрещенного контента, обрабатываются только на время проверки спам-фильтром и не хранятся после завершения проверки.Сообщения, отправленные на модерацию, обрабатываются до тех пор, пока модератор не просмотрит и не проверит их содержание и не хранятся после завершения проверки."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Пользователь не обязан предоставлять эти данные самостоятельно. Однако данные собираются Ботом автоматически в ходе работы сервиса, Пользователь не вправе отказаться от сбора указанных данных."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.7."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Работа партнерских программ, позволяющих Пользователям продвигать Бот и получать вознаграждение с покупок, совершенных привлеченными ими пользователями"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "ID пользователя, реферальная ссылка, количество рефералов (приглашенных пользователей), данные взаимодействия, связанные с партнерской деятельностью."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Законный интерес: для работы и оптимизации партнерской программы, обеспечение справедливой и прозрачной выплаты вознаграждения."
      ],
      [
        "Срок хранения персональных данных",
        "1 год после удаления Бота."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Пользователь не обязан предоставлять эти данные самостоятельно. Сбор данных происходит в рамках работы сервиса, Пользователь не вправе отказаться от сбора указанных данных."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.8."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Идентификация заблокированного пользователя"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "Идентификатор пользователя, метка статуса учетной записи (например, is_blocked)."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Законный интерес: поддержание безопасной среды путем идентификации и управления заблокированными пользователями, предотвращения злоупотреблений и обеспечения безопасности Сервиса."
      ],
      [
        "Срок хранения персональных данных",
        "1 год после удаления Бота."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Если Пользователь заблокирован, этот статус определяется автоматически; Пользователь не может отказаться от сбора данных, связанных с блокировкой."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.9."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Блокировка неприемлемых сообщений и/или фотографий"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "Идентификаторы пользователей, связанные с сообщениями, и информация о содержимом чата (сообщения, фотографии и т. д.)."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Законный интерес: обеспечение безопасной среды путем выявления и предотвращения распространения неприемлемого контента, защиты пользователей от вреда и соблюдения правил Бота."
      ],
      [
        "Срок хранения персональных данных",
        "Данные удаляются после проверки сообщений и/или фотографий модератором. Срок хранения данных, связанных с автоматической блокировкой (например, для ключевых слов, спама и т. д.), составляет до 1 года с даты блокировки."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Пользователь не обязан предоставлять эти данные, но может сообщить о сообщении, если считает его содержание неприемлемым."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.10."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Просмотр изображений в чате без размытия"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "ID пользователя, информация о состоянии функции размытия фотографий (вкл/выкл)."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Согласие пользователя: Пользователь может выбрать просмотр фотографий без размытия."
      ],
      [
        "Срок хранения персональных данных",
        "1 год после удаления Бота."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Пользователь может выбрать просмотр изображений без размытия. В случае отказа Пользователя он не сможет просматривать изображения без размытия."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.11."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Возможность оценивать действия других Пользователей"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "ID пользователя, информация об оценке пользователя."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Исполнение договора (Условия предоставления услуг): функция оценки является частью Услуг Сервиса."
      ],
      [
        "Срок хранения персональных данных",
        "1 год после удаления Бота."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Оценки ставятся другими Пользователями Бота."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.12."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Проведение рекламных кампаний"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "ID пользователя, язык устройства Пользователя, каналы, на которые подписан Пользователь, статус членства в Telegram."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Законный интерес: оптимизация рекламных усилий и улучшение таргетинга."
      ],
      [
        "Срок хранения персональных данных",
        "1 год после удаления Бота."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Данные собираются Ботом автоматически в ходе работы Сервиса, Пользователь не вправе отказаться от сбора указанных данных."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.13."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Обеспечение функциональности Бота"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "ID пользователя, язык устройства Пользователя, временная метка сообщения или события чата, идентификатор чата."
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Законный интерес: поддержание, улучшение и обеспечение надежной работы Бота."
      ],
      [
        "Срок хранения персональных данных",
        "1 ​​год после удаления Бота."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Нет, поскольку эти данные собираются автоматически в рамках работы Бота для поддержания его функциональности."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "4.14."
  },
  {
    "type": "table",
    "rows": [
      [
        "Цель",
        "Пользовательская поддержка и ответы на вопросы Пользователей"
      ],
      [
        "Категории обрабатываемых персональных данных",
        "Имя, адрес электронной почты, номер телефона, иные данные, направляемые Пользователем"
      ],
      [
        "Правовая основа для обработки персональных данных",
        "Согласие, выраженное Пользователем при обращении к нам, добровольное самостоятельное раскрытие данных при их отправке."
      ],
      [
        "Срок хранения персональных данных",
        "1 год с даты последнего обращения."
      ],
      [
        "Обязан ли Пользователь предоставлять персональные данные?",
        "Пользователь добровольно самостоятельно предоставляет указанные данные."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "5.    Как мы получаем ваши персональные данные?"
  },
  {
    "type": "paragraph",
    "text": "Бот — это самостоятельное приложение, которое работает на базе Telegram. Бот может получать некоторые данные пользователя из Telegram, как только пользователь начинает взаимодействовать с Ботом. Другие данные могут быть предоставлены непосредственно Пользователем при использовании бота или при обращении к нам по электронной почте службы поддержки."
  },
  {
    "type": "paragraph",
    "text": "6. Кому мы передаем ваши персональные данные?"
  },
  {
    "type": "paragraph",
    "text": "Мы можем раскрывать все или часть ваших персональных данных следующим получателям данных:"
  },
  {
    "type": "paragraph",
    "text": "Telegram – оператор платформы Бота и наш хостинг-провайдер."
  },
  {
    "type": "paragraph",
    "text": "Другим пользователям Бота для обеспечения коммуникации/поиска партнеров."
  },
  {
    "type": "paragraph",
    "text": "Судам, другим компетентным органам или правоохранительным органам: данные могут быть раскрыты в случаях и в порядке, предусмотренных правовыми актами, но только по их запросу и только в тех случаях, когда это требуется в соответствии с применимыми правовыми актами или для предъявления, исполнения или защиты правовых требований."
  },
  {
    "type": "paragraph",
    "text": "Операторам платежей при совершении платежей."
  },
  {
    "type": "paragraph",
    "text": "7. Собираем ли мы вашу финансовую информацию, когда вы совершаете покупки?"
  },
  {
    "type": "paragraph",
    "text": "Когда вы совершаете покупки при использовании Бота, мы не собираем данные о ваших платежных операциях и не имеем доступа к вашей платежной информации. Эта информация собирается и хранится Telegram и его уполномоченными операторами. Ознакомьтесь с Политикой конфиденциальности Telegram здесь: https://telegram.org/privacy/eu."
  },
  {
    "type": "paragraph",
    "text": "Некоторые данные, необходимые для работы указанных платежных сервисов, собираются ими напрямую, мы не имеем к ним доступ и не обрабатываем такие данные. Мы рекомендуем ознакомиться с политиками данных сервисов, регулирующими сбор и использование персональных данных."
  },
  {
    "type": "table",
    "rows": [
      [
        "Сторонние процессоры данных",
        "Категория персональных данных",
        "Политика конфиденциальности"
      ],
      [
        "Tribute",
        "ID Telegram, Данные о покупках",
        "https://tribute.tg/privacy-policy.html"
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "8. Передаем ли мы ваши персональные данные за пределы Европейской экономической зоны (ЕЭЗ)?"
  },
  {
    "type": "paragraph",
    "text": "Хостинг-провайдер, обеспечивающий функционирование Бота, находится в ЕЭЗ."
  },
  {
    "type": "paragraph",
    "text": "Telegram управляет глобальной инфраструктурой; следовательно, персональные данные, обмениваемые с Telegram, могут передаваться на серверы и аффилированным лицам, расположенным за пределами ЕЭЗ. Такая передача необходима для оказания услуг и осуществляется на правовом основании статьи 49(1)(b) GDPR (исполнение договора). Подробную информацию о том, как Telegram обрабатывает данные и обеспечивает безопасность передачи, см. в политике конфиденциальности Telegram: https://telegram.org/privacy."
  },
  {
    "type": "paragraph",
    "text": "Другие пользователи Бота, с которыми Пользователь общается и делится определенной информацией, могут находиться за пределами ЕЭЗ. Такие передачи необходимы для оказания услуги и осуществляются на правовом основании, предусмотренном статьей 49(1)(b) GDPR (исполнение договора)."
  },
  {
    "type": "paragraph",
    "text": "Используем ли мы автоматизированные решения, включая профайлинг?"
  },
  {
    "type": "paragraph",
    "text": "Автоматические решения могут приниматься для предотвращения спама или злоупотреблений (автоматическая блокировка), но в любом такие решения модерируются вручную и могут быть оспорены."
  },
  {
    "type": "paragraph",
    "text": "Какие у Вас есть права?"
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Европейского союза"
  },
  {
    "type": "paragraph",
    "text": "Право на доступ: право получить подтверждение того, обрабатываем ли мы персональные данные, относящиеся к Пользователю, и, если мы их обрабатываем, право запросить доступ к обрабатываемым персональным данным;"
  },
  {
    "type": "paragraph",
    "text": "Право на исправление: право Пользователя без неоправданных задержек требовать от Контролера исправления некорректных персональных данных;"
  },
  {
    "type": "paragraph",
    "text": "Право на забвение – при определенных обстоятельствах, указанных в GDPR (например, когда персональные данные обрабатываются незаконно, персональные данные больше не нужны для целей, для которых они были собраны, и т. п.), Пользователь вправе требовать от Контролера удаления персональных данных, касающихся его, немедленно;"
  },
  {
    "type": "paragraph",
    "text": "Право на ограничение – при определенных обстоятельствах, указанных в GDPR, право требовать от Контролера ограничения обработки персональных данных;"
  },
  {
    "type": "paragraph",
    "text": "Право на возражение – право Пользователя выразить несогласие с обработкой персональных данных, когда Контролер обрабатывает персональные данные на основании легитимного интереса;"
  },
  {
    "type": "paragraph",
    "text": "Право на перенос данных – право направить запрос на передачу (получение) персональных данных, обработка которых основана на согласии Пользователя или исполнении договора, заключенного с Пользователем, если эти персональные данные обрабатываются с помощью автоматизированных средств;"
  },
  {
    "type": "paragraph",
    "text": "Право на отзыв согласия – в случаях, когда мы обрабатываем Ваши персональные данные на основании Вашего согласия, Вы имеете право в любое время отозвать свое согласие, и обработка его персональных данных для целей, которые были основаны на согласии пользователя, будет прекращена, без ущерба для законности обработки персональных данных на основании согласия до его отзыва."
  },
  {
    "type": "paragraph",
    "text": "●    Право на подачу жалобы в надзорный орган (см. Раздел 11)."
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Российской Федерации"
  },
  {
    "type": "paragraph",
    "text": "Если вы являетесь субъектом персональных данных из Российской Федерации, то вы имеете право на обеспечение защиты ваших прав и свобод при обработке Персональных данных, защиты прав на неприкосновенность частной жизни, личную и семейную тайну, в частности вы имеете права:"
  },
  {
    "type": "paragraph",
    "text": "требовать от нас как от оператора уточнения ваших Персональных данных, их блокирования или уничтожения в случае, если Персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав;"
  },
  {
    "type": "paragraph",
    "text": "на получение информации, касающейся обработки ваших Персональных данных, в том числе содержащей: подтверждение факта обработки Персональных данных оператором; правовые основания и цели обработки Персональных данных; цели и применяемые оператором способы обработки Персональных данных; наименование и место нахождения оператора, сведения о лицах (за исключением работников оператора), которые имеют доступ к Персональным данным или которым могут быть раскрыты Персональные данные на основании договора с оператором или на основании Федерального закона; обрабатываемые Персональные данные, относящиеся к соответствующему субъекту Персональных данных, источник их получения; сроки обработки Персональных данных, в том числе сроки их хранения; информацию об осуществленной или о предполагаемой трансграничной передаче данных; наименование или фамилию, имя, отчество и адрес лица, осуществляющего обработку Персональных данных по поручению оператора, если обработка поручена или будет поручена таковому лицу; иные сведения;"
  },
  {
    "type": "paragraph",
    "text": "на защиту своих прав и законных интересов, в том числе на возмещение убытков и (или) компенсацию морального вреда в судебном порядке."
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Бразилии"
  },
  {
    "type": "paragraph",
    "text": "В случае, если бразильское законодательство применимо к обработке ваших Персональных данных, вы имеете право запросить у Maljoy:"
  },
  {
    "type": "paragraph",
    "text": "подтверждение факта обработки данных;"
  },
  {
    "type": "paragraph",
    "text": "доступ к обработанным данным;"
  },
  {
    "type": "paragraph",
    "text": "исправление неполных, неточных или устаревших данных;"
  },
  {
    "type": "paragraph",
    "text": "анонимизацию, блокировку или удаление ненужных, избыточных данных или данных, обработанных в нарушение положений Закона Бразилии о защите данных (LGPD);"
  },
  {
    "type": "paragraph",
    "text": "возможность переноса данных другому поставщику услуг или продуктов посредством прямого запроса в соответствии с требованиями национального органа по защите данных (ANPD) и с учетом требований коммерческой и производственной тайны;"
  },
  {
    "type": "paragraph",
    "text": "удаление персональных данных, обрабатываемых с вашего согласия;"
  },
  {
    "type": "paragraph",
    "text": "информацию о государственных и частных организациях, с которыми Maljoy поделились данными;"
  },
  {
    "type": "paragraph",
    "text": "сведения о возможности отказа в согласии и последствиях такого отказа."
  },
  {
    "type": "paragraph",
    "text": "Также вы можете отзывать свое согласие на обработку Персональных данных, возразить против обработки, осуществляемой на основании одной из ситуаций отказа от согласия, если имеет место нарушение положений LGPD. Мы не принимает решения, основанные исключительно на автоматизированной обработке Персональных данных, однако вы в любом случае имеете право на пересмотр решений, принятых исключительно на основе автоматизированной обработки персональных данных, затрагивающих ваши интересы, включая решения, направленные на определение вашего личного, профессионального, потребительского и кредитного профиля или иных аспектов вашей личности."
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Индонезии"
  },
  {
    "type": "paragraph",
    "text": "Если вы являетесь резидентом Республики Индонезия, Закон № 27 от 2022 года о защите персональных данных (Undang-Undang Pelindungan Data Pribadi, или «UUPK» — далее именуемый «UUPK» или «UU PDP»), вступивший в силу в октябре 2024 года, предоставляет вам следующие права в отношении ваших персональных данных, которые мы обрабатываем:"
  },
  {
    "type": "paragraph",
    "text": "Право на доступ (статья 34 UU PDP). Вы имеете право запросить подтверждение того, обрабатываем ли мы ваши персональные данные, и если да, то получить доступ к этим данным, включая информацию о целях обработки, категориях обрабатываемых данных и получателях, которым ваши данные были или могут быть раскрыты."
  },
  {
    "type": "paragraph",
    "text": "Право на исправление (статья 35 UU PDP). Вы имеете право запросить исправление неточных или неполных персональных данных о вас без неоправданной задержки."
  },
  {
    "type": "paragraph",
    "text": "Право на прекращение обработки и удаление (статья 36 UU PDP). Вы имеете право потребовать прекращения обработки и удаления ваших персональных данных в следующих случаях: (i) персональные данные больше не нужны для целей, для которых они были собраны; (ii) вы отозвали свое согласие, и нет других законных оснований для его обработки; (iii) вы успешно возразили против обработки; или (iv) обработка является незаконной."
  },
  {
    "type": "paragraph",
    "text": "Право на отзыв согласия (статья 38 UU PDP). Если мы обрабатываем ваши персональные данные на основании вашего согласия, вы имеете право отозвать это согласие в любое время. Отзыв согласия не влияет на законность обработки, проведенной до отзыва."
  },
  {
    "type": "paragraph",
    "text": "Право на возражение против автоматизированной обработки (статья 40 UU PDP). Вы имеете право не подвергаться решению, основанному исключительно на автоматизированной обработке, включая профилирование, которое имеет для вас юридические или аналогичные существенные последствия. В случае такой обработки вы имеете право запросить пересмотр решения человеком."
  },
  {
    "type": "paragraph",
    "text": "Право на задержку или ограничение обработки (статья 37 UU PDP). Вы имеете право запросить временную приостановку обработки ваших персональных данных на время разрешения спора относительно точности ваших данных или законности нашей обработки."
  },
  {
    "type": "paragraph",
    "text": "Право на переносимость данных (статья UU PDP). Если это технически возможно, вы имеете право получить копию предоставленных вами персональных данных в структурированном, общепринятом и машиночитаемом формате и запросить передачу этих данных другому контроллеру."
  },
  {
    "type": "paragraph",
    "text": "Право на получение компенсации (статья UU PDP). Вы имеете право требовать компенсацию или иное возмещение ущерба в гражданском порядке, если вы понесли материальный или нематериальный ущерб в результате нашего несоблюдения UU PDP."
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Индии"
  },
  {
    "type": "paragraph",
    "text": "Если вы являетесь резидентом Индии, Закон о защите персональных данных в цифровую эпоху 2023 года («DPDPA») предоставляет вам следующие права как субъекту данных в отношении ваших персональных данных, которые мы обрабатываем в качестве доверительного управляющего данными:"
  },
  {
    "type": "paragraph",
    "text": "Право доступа к информации об обработке (Раздел 11 DPDPA). Вы имеете право запросить у нас следующую информацию: (i) краткое описание персональных данных, которые мы храним о вас, и способы их обработки; (ii) идентификационные данные всех доверительных управляющих данными и обработчиков данных, с которыми мы поделились вашими персональными данными, и описание переданных персональных данных; и (iii) любую другую информацию, которая может быть предписана центральным правительством. Мы предоставим эту информацию в разумные сроки после получения вашего запроса."
  },
  {
    "type": "paragraph",
    "text": "Право на исправление, дополнение, обновление и удаление (Раздел 12 DPDPA). Вы имеете право запросить у нас: (i) исправление неточных или вводящих в заблуждение персональных данных; (ii) дополнение неполных персональных данных; (iii) обновление устаревших персональных данных; и (iv) удалить персональные данные, которые больше не нужны для цели, для которой они были собраны, или если вы отозвали согласие и нет другого законного основания. Мы обработаем обоснованные запросы в разумные сроки."
  },
  {
    "type": "paragraph",
    "text": "Право на отзыв согласия (раздел 6(4) DPDPA). Если мы обрабатываем ваши персональные данные на основании вашего согласия, вы можете отозвать это согласие в любое время. Отзыв согласия так же прост, как и его предоставление. После отзыва мы прекратим обработку ваших персональных данных, если не применяется другое законное основание в соответствии с DPDPA. Отзыв согласия не влияет на законность обработки, осуществленной до отзыва."
  },
  {
    "type": "paragraph",
    "text": "Право на обжалование (раздел 13 DPDPA). Вы имеете право на оперативное рассмотрение ваших жалоб, касающихся обработки нами ваших персональных данных. Если вы не удовлетворены нашим ответом, вы можете направить свою жалобу в Совет по защите данных Индии (см. ниже)."
  },
  {
    "type": "paragraph",
    "text": "Право на назначение (раздел 14 DPDPA). Вы имеете право назначить любое другое лицо для осуществления ваших прав на защиту данных в случае вашей смерти или недееспособности. Для регистрации или обновления вашего назначения, пожалуйста, свяжитесь с нами по адресу privacy@maljoy.io."
  },
  {
    "type": "paragraph",
    "text": "Персональные данные детей (раздел 9 Закона о защите персональных данных). Мы сознательно не обрабатываем персональные данные детей (лиц младше 18 лет) без получения подтвержденного согласия от их родителей или законных опекунов. Мы также не занимаемся отслеживанием или мониторингом поведения детей, а также не осуществляем целевую рекламу для детей через Сервис. Если вы являетесь родителем или опекуном ребенка и считаете, что мы могли обработать персональные данные вашего ребенка без надлежащего согласия, пожалуйста, немедленно свяжитесь с нами по адресу privacy@maljoy.io."
  },
  {
    "type": "paragraph",
    "text": "Как реализовать свои права. Чтобы реализовать любое из перечисленных выше прав, пожалуйста, свяжитесь с нами по адресу privacy@maljoy.io. Мы ответим на ваш запрос в разумные сроки и, в любом случае, в течение тридцати (30) дней. Нам может потребоваться подтвердить вашу личность, прежде чем обрабатывать ваш запрос."
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Турецкой Республики"
  },
  {
    "type": "paragraph",
    "text": "Закон о защите персональных данных № 6698 (“DPL”) содержит права субъектов данных, получающих доступ к услугам из Турецкой Республики. Вы имеете право обратиться к Контролеру данных, чтобы:"
  },
  {
    "type": "paragraph",
    "text": "узнать, обрабатываются ли ваши персональные данные;"
  },
  {
    "type": "paragraph",
    "text": "запросить информацию о том, были ли обработаны ваши персональные данные;"
  },
  {
    "type": "paragraph",
    "text": "узнать цель обработки ваших персональных данных и используются ли эти персональные данные в соответствии с целью;"
  },
  {
    "type": "paragraph",
    "text": "знать третьих лиц, которым передаются ваши персональные данные в стране или за рубежом;"
  },
  {
    "type": "paragraph",
    "text": "запросить исправление неполных или неточных данных, если таковые имеются;"
  },
  {
    "type": "paragraph",
    "text": "запросить удаление ваших персональных данных в соответствии с условиями, указанными в статье 7 DPL;"
  },
  {
    "type": "paragraph",
    "text": "запрашивать отчетность об операциях, проведенных в определенных случаях, у третьих лиц, которым были переданы ваши персональные данные;"
  },
  {
    "type": "paragraph",
    "text": "самостоятельно возражать против наступления результата в отношении данного лица путем анализа данных, обрабатываемых исключительно с помощью автоматизированных систем;"
  },
  {
    "type": "paragraph",
    "text": "требовать компенсации за ущерб, возникший в результате незаконной обработки ваших персональных данных."
  },
  {
    "type": "paragraph",
    "text": "Для реализации своих прав или по иным вопросам, связанным с обеспечением конфиденциальности персональных данных, Вы можете связаться с нами по адресу:  privacy@maljoy.io."
  },
  {
    "type": "paragraph",
    "text": "11. Связаться с органами по защите данных"
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Европейской экономической зоны (ЕЭЗ): если вы проживаете в Европейской экономической зоне и считаете, что мы незаконно обрабатываем Ваши персональные данные, Вы имеете право подать жалобу в местный надзорный орган по защите данных. Вы можете найти контактную информацию здесь https://www.edpb.europa.eu/about-edpb/about-edpb/members_en."
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Российской Федерации: если вы считаете, что ваши права нарушаются, вы можете обратиться в Уполномоченный орган по защите прав субъектов персональных данных – Роскомнадзор. Вы можете найти контактные данные по адресу: https://rkn.gov.ru/contacts/."
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Бразилии: если вы полагаете, что наше взаимодействие с Вашими Персональными данными нарушает действующее законодательство, вы можете направить соответствующий запрос в Бразильский орган по защите данных (ANPD)."
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Индонезии: если вы считаете, что обработка нами ваших персональных данных нарушает UU PDP или другие применимые индонезийские законы, вы имеете право подать жалобу в компетентный надзорный орган. До тех пор, пока правительство Индонезии не создаст и не введет в действие специальный орган по защите персональных данных (Lembaga Pelindungan Data Pribadi), упомянутый в статье 58 Уголовно-процессуального кодекса о защите персональных данных, жалобы, касающиеся обработки персональных данных, могут быть направлены в Министерство связи и цифровых технологий (Kementerian Komunikasi dan Digital, «Komdigi»), ранее Министерство связи и информационных технологий (Kominfo) https://komdigi.go.id. Портал для подачи жалоб: https://aduankonten.id."
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Индии: если вы считаете, что наша обработка ваших персональных данных нарушает Закон о защите персональных данных (DPDPA) или другой применимый индийский закон о защите данных, вы имеете право подать жалобу в Совет по защите данных Индии (https://dpboard.gov.in). В соответствии с разделом 13(2) DPDPA, прежде чем подавать жалобу в DPBI, субъект данных должен сначала позволить доверенному лицу данных разрешить спор."
  },
  {
    "type": "paragraph",
    "text": "Соответственно, мы рекомендуем вам сначала связаться с нами по адресу privacy@maljoy.io, чтобы мы могли попытаться решить вашу проблему напрямую. Если вы не удовлетворены нашим ответом, вы можете передать жалобу в DPBI."
  },
  {
    "type": "paragraph",
    "text": "Для резидентов Турецкой Республики: если вы считаете, что ваши права нарушаются, вы можете обратиться в Управление по защите персональных данных. Вы можете найти контактную информацию здесь: https://www.kvkk.gov.tr/Icerik/6655/Contact-Us."
  },
  {
    "type": "paragraph",
    "text": "12. Продаются ли персональные данные третьим лицам?"
  },
  {
    "type": "paragraph",
    "text": "Нет, мы не продаем персональные данные пользователей Бота третьим лицам и никогда не и никогда не осуществляли попыток продать какие-либо персональные данные."
  },
  {
    "type": "paragraph",
    "text": "14. Изменения в Политике Конфиденциальности"
  },
  {
    "type": "paragraph",
    "text": "Мы сделаем все возможное, чтобы сообщить об изменениях в настоящей Политике конфиденциальности через Бот или Сервис, но мы рекомендуем вам время от времени просматривать настоящую Политику конфиденциальности, чтобы быть ознакомленным с ее последней версией. Ваше дальнейшее использование Бота или Сервиса после любых изменений в данной Политике означает принятие новой редакции Политики конфиденциальности."
  },
  {
    "type": "paragraph",
    "text": "С уважением,"
  },
  {
    "type": "paragraph",
    "text": "Команда MALJOY"
  }
];

export const enPrivacyBlocks: LegalBlock[] = [
  {
    "type": "paragraph",
    "text": "PRIVACY POLICY"
  },
  {
    "type": "paragraph",
    "text": "Last updated: June 1, 2026."
  },
  {
    "type": "paragraph",
    "text": "Hello! This Privacy Policy explains how and why MALJOY LTD (“we” or derivatives) processes your personal data (the “Policy”) while you play the Bot as defined below."
  },
  {
    "type": "paragraph",
    "text": "We take your privacy and the protection of your personal data seriously. To ensure lawful and transparent handling of your personal data, we have prepared this Privacy Policy."
  },
  {
    "type": "paragraph",
    "text": "Who are we?"
  },
  {
    "type": "paragraph",
    "text": "We are MALJOY LTD, a company which is established and operates in accordance with the laws of the United Kingdom. Registration No.16216055. Registered address: Suite 12, 2nd Floor Queens House, 180 Tottenham Court Road, London, United Kingdom, W1T 7PD."
  },
  {
    "type": "paragraph",
    "text": "We are the controller of your personal data, that is, we independently determine how and why we process your personal data (the “Controller\");"
  },
  {
    "type": "paragraph",
    "text": "SINCE ACCESS TO THE BOT IS PROVIDED REMOTELY, WE MAY INADVERTENTLY COLLECT PERSONAL DATA FROM PERSONS UNDER THE AGE OF 16. IF YOU ARE A MINOR, PLEASE REFRAIN FROM ANY USE OF THE BOT AND ACCESS THERETO. WE WILL COMPLETELY ERASE YOUR DATA IMMEDIATELY UPON YOUR OR YOUR LEGAL GUARDIAN’S REQUEST."
  },
  {
    "type": "paragraph",
    "text": "Definitions"
  },
  {
    "type": "paragraph",
    "text": "Bot – anonymous chat “Anonymous chat | Dating (username @chatus, @anonymous_chatusbot”, that is a small application that runs entirely within the Telegram app for mobile devices and personal computers."
  },
  {
    "type": "paragraph",
    "text": "User – an individual who interacts with the Bot via the Telegram app to access the anonymous chat service."
  },
  {
    "type": "paragraph",
    "text": "Personal Data – any information that can be used to identify a person, as well as any information about a person who is already identified."
  },
  {
    "type": "paragraph",
    "text": "GDPR – Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons about the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC."
  },
  {
    "type": "paragraph",
    "text": "Telegram – a mobile and desktop app known under the name ‘Telegram’ for Android- and iOS-run mobile devices, as well as for personal computers, providing communication and messaging features for its users, including but not limited to Bot and Service."
  },
  {
    "type": "paragraph",
    "text": "What is this Privacy Policy for?"
  },
  {
    "type": "paragraph",
    "text": "This Privacy Policy explains what personal data we collect and why we process it when the User uses the Bot. It also sets out other important information about how we handle personal data, the User rights, and how to exercise them."
  },
  {
    "type": "paragraph",
    "text": "For what purposes and what personal data do we process?"
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To identify the Bot user"
      ],
      [
        "Categories of personal data processed",
        "Telegram identifiers (user ID, username, profile link)."
      ],
      [
        "Legal basis for processing personal data",
        "Legitimate interest: to operate, maintain and secure the service (prevent abuse, troubleshoot, ensure functionality)."
      ],
      [
        "Personal data retention period",
        "1 year after the Bot is deleted."
      ],
      [
        "Is the User obliged to provide personal data?",
        "The User is not required to provide additional personal data to us. The Bot receives the necessary data from Telegram when the User uses the Bot."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To match users"
      ],
      [
        "Categories of personal data processed",
        "User ID, gender, age (optional)."
      ],
      [
        "Legal basis for processing personal data",
        "Performance of a contract (Terms of Service): processing is necessary to deliver the service the User requested, such as matching users based on their gender and / or age preferences."
      ],
      [
        "Personal data retention period",
        "1 year after the Bot is deleted."
      ],
      [
        "Is the User obliged to provide personal data?",
        "Gender is mandatory to enable matching. If the User chooses not to provide the mandatory data (gender), the User may not be able to use the matching features of the Bot. However, providing age is optional. If user does not provide this information, the Bot will have limited matching functionality."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To match Bot’s users with same interests"
      ],
      [
        "Categories of personal data processed",
        "User ID, information about personal interest (close-ended list): financial support, roleplay, friendship, loneliness, music, cinema, books, sports, memes, anime, Korea, pets, technology, games, twitch."
      ],
      [
        "Legal basis for processing personal data",
        "Performance of a contract (Terms of Service): processing is necessary to deliver the service the User requested, such as matching users based on their interests."
      ],
      [
        "Personal data retention period",
        "1 year after the Bot is deleted."
      ],
      [
        "Is the User obliged to provide personal data?",
        "Providing interests is not mandatory. The User can choose whether or not to share his/her interests. If User does not provide this information, the Bot will have limited matching functionality."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To identify user as a premium user and allow to use services available to premium users"
      ],
      [
        "Categories of personal data processed",
        "User ID, membership expire time, amount of donates of Telegram stars."
      ],
      [
        "Legal basis for processing personal data",
        "Performance of a contract (Terms of Service): processing is necessary to verify premium membership and provide the associated services."
      ],
      [
        "Personal data retention period",
        "1 year after deleting the Bot."
      ],
      [
        "Is the User obliged to provide personal data?",
        "Since this information is received directly from Telegram, the Users is not required to provide it himself. The data is collected automatically as part of the service when the User interact with the Bot."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To record and monitor user and system actions for security, debugging, abuse prevention, and service performance control."
      ],
      [
        "Categories of personal data processed",
        "Usage data (e.g. timestamp of the event (created_at, updated_at), technical metadata (is_media, ip_address, user_agent, log_level), optional diagnostic or contextual data (context, meta), etc.).Action logs (e.g. action type or event name (action, e.g., start_chat, send_message, report_user), context or parameter value associated with the action (value – may include message ID, hash, or short code but not full message content), message and routing identifiers (message_id, sended_id), etc.)."
      ],
      [
        "Legal basis for processing personal data",
        "Legitimate interest: to ensure service security, monitor usage, prevent abuse, and improve the quality of the Bot."
      ],
      [
        "Personal data retention period",
        "The data are processed only for the duration of the monitoring check and are not stored afterwards."
      ],
      [
        "Is the User obliged to provide personal data?",
        "The User is not obliged to provide this data himself. However, the data is collected automatically by the Bot during normal operation of the service, and users cannot opt out of this automatic collection."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To prevent anti-fraud, anti-spam and other illegal activities"
      ],
      [
        "Categories of personal data processed",
        "Number of chats (per day, per month, per year, etc), chat duration, number of messages received, last activity, chat content."
      ],
      [
        "Legal basis for processing personal data",
        "Legitimate interest: to protect the service and users from fraud, spam, and other illegal activites, ensuring safe and trustworthy interactions."
      ],
      [
        "Personal data retention period",
        "1 year after the Bot is deleted.Chat messages without detected prohibited content are processed only for the duration of the spam filter check and are not stored afterwards. Chat messages flagged for moderation are processed until the moderator reviews and inspects the content and are not stored afterwards."
      ],
      [
        "Is the User obliged to provide personal data?",
        "The User is not obliged to provide this data himself. However, the data is collected automatically by the Bot during normal operation of the service, and users cannot opt out of this automatic collection."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "Affiliate programs allowing Telegram users to promote the Bot and earn commissions on purchases made by people they referred."
      ],
      [
        "Categories of personal data processed",
        "User ID, referral link, referrals count (user invites), interaction logs related to affiliate activities."
      ],
      [
        "Legal basis for processing personal data",
        "Legitimate interest: to operate and optimize the affiliate program, ensuring fair and transparent awarding of commissions."
      ],
      [
        "Personal data retention period",
        "1 year after deleting the Bot."
      ],
      [
        "Are you obliged to provide personal data?",
        "The User is not obliged to provide this data himself. The data collection occurs as part of the service operation, and users cannot opt out of the automatic collection necessary for tracking referrals and commissions."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To identify blocked user"
      ],
      [
        "Categories of personal data processed",
        "User ID, account status flags (e.g., is_blocked)."
      ],
      [
        "Legal basis for processing personal data",
        "Legitimate interest: to maintain a safe environment by identifying and managing blocked users, preventing abuse, and ensuring the security of the service."
      ],
      [
        "Personal data retention period",
        "1 year after deleting the Bot."
      ],
      [
        "Are you obliged to provide personal data?",
        "If the User is blocked, that status is determined automatically; the User cannot opt out of this data collection related to blocking."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To block inappropriate messages and/or photos"
      ],
      [
        "Categories of personal data processed",
        "User IDs associated with messages, reported chat content (message, photo, etc.)."
      ],
      [
        "Legal basis for processing personal data",
        "Legitimate interest: to ensure a safe environment by detecting and preventing the sharing of inappropriate content, protecting users from harm, and maintaining compliance with Bot policies."
      ],
      [
        "Personal data retention period",
        "Data is deleted after moderator reviews messages and/or photo. The storage period for data related to automated bans (e.g., for banwords, spam, etc.) is up to 1 year from the date of ban."
      ],
      [
        "Are you obliged to provide personal data?",
        "The User is not obliged to provide this data but can report a message if he/she thinks that the content of the message is inappropriate."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To allow users to see unblurred photos"
      ],
      [
        "Categories of personal data processed",
        "User ID, information on status of photo blur function (on/off)."
      ],
      [
        "Legal basis for processing personal data",
        "User’s consent: the User can choose to see unblurred photos."
      ],
      [
        "Personal data retention period",
        "1 year after deleting the Bot."
      ],
      [
        "Are you obliged to provide personal data?",
        "The User can choose to see unblurred photos. If the user chooses not to consent, he/she will not be able to see the unblurred images."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To enable users to have ratings"
      ],
      [
        "Categories of personal data processed",
        "User ID, information about User's rate."
      ],
      [
        "Legal basis for processing personal data",
        "Performance of a contract (Terms of Service): rating feature is part of a service."
      ],
      [
        "Personal data retention period",
        "1 year after deleting the Bot."
      ],
      [
        "Are you obliged to provide personal data?",
        "Ratings are given by other users."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To run advertisement campaigns"
      ],
      [
        "Categories of personal data processed",
        "User ID, language, channels subscribed, Telegram membership status."
      ],
      [
        "Legal basis for processing personal data",
        "Legitimate interest: to optimize advertising efforts and improve targeting."
      ],
      [
        "Personal data retention period",
        "1 year after deleting the Bot."
      ],
      [
        "Are you obliged to provide personal data?",
        "The data is gathered as part of the service operation, and users cannot opt out of this automatic collection."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To ensure Bot functionality"
      ],
      [
        "Categories of personal data processed",
        "User ID, language, timestamp of message or chat event, chat ID."
      ],
      [
        "Legal basis for processing personal data",
        "Legitimate interest: to maintain, improve, and ensure the reliable operation of the Bot."
      ],
      [
        "Personal data retention period",
        "1 year after deleting the Bot."
      ],
      [
        "Are you obliged to provide personal data?",
        "No, since this data is automatically collected as part of the Bot’s normal operation for maintaining functionality."
      ]
    ]
  },
  {
    "type": "table",
    "rows": [
      [
        "Purpose",
        "To provide you with the support and address your questions"
      ],
      [
        "Categories of personal data processed",
        "Name, e-mail, phone No., other data which user can share"
      ],
      [
        "Legal basis for processing personal data",
        "Your consent which you express by contacting us, voluntary independent disclosure of data when sending it to us."
      ],
      [
        "Personal data retention period",
        "1 year from the last contact date."
      ],
      [
        "Are you obliged to provide personal data?",
        "You voluntarily 1provide the data while contacting us."
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "From where do we get your personal data?"
  },
  {
    "type": "paragraph",
    "text": "The Bot is a small application that runs within the Telegram app. It may receive certain user data from Telegram once a user starts interacting with the Bot. Additional information may be provided directly by the user while using the Bot or contacting us via support email."
  },
  {
    "type": "paragraph",
    "text": "To whom do we transfer your personal data?"
  },
  {
    "type": "paragraph",
    "text": "We may disclose all or part of your personal data to the following data recipients:"
  },
  {
    "type": "paragraph",
    "text": "Telegram (platform provider) and our hosting provider."
  },
  {
    "type": "paragraph",
    "text": "Other Bot users as necessary to enable chat/matching."
  },
  {
    "type": "paragraph",
    "text": "Courts, other competent authorities or law enforcement agencies: the data may be disclosed in cases and according to the procedure provided for by legal acts, but only at their request and only when required by applicable legal acts or in order to make, execute or defend legal claims."
  },
  {
    "type": "paragraph",
    "text": "Payment service providers, when you make payments."
  },
  {
    "type": "paragraph",
    "text": "Do we collect your financial information when you make in-built purchases?"
  },
  {
    "type": "paragraph",
    "text": "When you make in-built purchases in the Bot, we do not collect data about the payment transactions you make, and we do not have access to your payment information. This information is collected and stored by Telegram and its authorised operators. Please see Telegram’s Privacy Policy here - https://telegram.org/privacy/eu."
  },
  {
    "type": "paragraph",
    "text": "Some data required for the operation of these payment services is collected directly by them; we do not have access to or process such data. We recommend that you familiarise yourself with the policies of these services, which govern the collection and use of personal data."
  },
  {
    "type": "table",
    "rows": [
      [
        "Third-party data processors",
        "Personal data category",
        "Privacy Policy"
      ],
      [
        "Tribute",
        "ID Telegram, Purchase Data",
        "https://tribute.tg/privacy-policy.html"
      ],
      [
        "Stripe",
        "ID Telegram, Purchase Data",
        "https://stripe.com/en-lt/privacy"
      ]
    ]
  },
  {
    "type": "paragraph",
    "text": "Do we transfer your personal data outside the European Economic Area (EEA)?"
  },
  {
    "type": "paragraph",
    "text": "Our hosting provider is based in the EEA."
  },
  {
    "type": "paragraph",
    "text": "Telegram operates a global infrastructure; consequently, personal data exchanged with Telegram may be transferred to servers and affiliates located outside the EEA. These transfers are necessary for the performance of the service and are carried out on the legal basis of Article 49(1)(b) GDPR (necessary for the performance of the contract). For details about how Telegram processes data and safeguards transfers, see Telegram’s privacy policy: https://telegram.org/privacy."
  },
  {
    "type": "paragraph",
    "text": "Other users of the Bot with whom the User chooses to communicate with and share certain information, may be located outside the EEA. These transfers are necessary for the performance of the service and are carried out on the legal basis of Article 49(1)(b) GDPR (necessary for the performance of the contract)."
  },
  {
    "type": "paragraph",
    "text": "Do we make automated decisions, including profiling?"
  },
  {
    "type": "paragraph",
    "text": "Automated decisions may occur for spam or abuse prevention (automatic blocking), but such decisions are subject to human review and appeal."
  },
  {
    "type": "paragraph",
    "text": "What rights do you have?"
  },
  {
    "type": "paragraph",
    "text": "For users in the European Union"
  },
  {
    "type": "paragraph",
    "text": "The right of access: the right to receive confirmation whether we process personal data related to user and, if we process it, to request access to the processed personal data;"
  },
  {
    "type": "paragraph",
    "text": "The right to rectification:  the right to obtain from the controller without undue delay the rectification of inaccurate personal data concerning him or her;"
  },
  {
    "type": "paragraph",
    "text": "The right to be forgotten – under certain circumstances mentioned in the GDPR (for example, when personal data is processed unlawfully, personal data is no longer necessary for the purpose for which this personal data was collected, etc.), the user shall have the right to obtain from the controller the erasure of personal data concerning him or her without undue delay;"
  },
  {
    "type": "paragraph",
    "text": "The right to restrict – under certain circumstances mentioned in the GDPR the right to obtain from the controller restriction of processing;"
  },
  {
    "type": "paragraph",
    "text": "The right to object – the right to express disagreement with the processing of personal data when we process personal data based on the legitimate interests;"
  },
  {
    "type": "paragraph",
    "text": "The right to data portability – the right to submit a request to transfer (receive) personal data, the processing of which is based on your consent or the performance of a contract concluded with the user, if this personal data is processed by automated means;"
  },
  {
    "type": "paragraph",
    "text": "The right to withdraw the consent – in cases where we process your personal data based on the user’s consent, the user has the right to withdraw his/her consent at any time and the processing of his/her personal data for the purposes that were based on user’s consent will be terminated, without prejudice to the lawfulness of the processing of personal data based on consent before its withdrawal."
  },
  {
    "type": "paragraph",
    "text": "The right to lodge a complaint with a supervisory authority (see Section 11)."
  },
  {
    "type": "paragraph",
    "text": "For residents of the Russian Federation"
  },
  {
    "type": "paragraph",
    "text": "If you are a personal data subject from the Russian Federation, then you have the right to ensure the protection of your rights and freedoms when processing personal Data, protection of the rights to privacy, personal and family secrets, in particular, you have the right:"
  },
  {
    "type": "paragraph",
    "text": "require us, as an operator, to clarify your Personal data, block or destroy it if the personal data is incomplete, outdated, inaccurate, illegally obtained or is not necessary for the stated purpose of processing, as well as take legal measures to protect your rights;"
  },
  {
    "type": "paragraph",
    "text": "to receive information related to the processing of your Personal Data, including: confirmation of the fact of processing Personal Data by the operator; legal grounds and purposes of processing Personal Data; purposes and methods of processing Personal Data used by the operator; name and location of the operator, information about persons (except for employees of the operator) who have access to Personal Data or to whom Personal Data may be disclosed based on an agreement with the operator or based on Federal Law; processed Personal Data related to the relevant Personal Data subject, the source of their receipt; terms of processing of Personal Data, including the terms of their storage; information about the performed or proposed cross-border data transfer; name or surname, first name, patronymic and address of the person processing Personal Data on behalf of the operator, if processing is entrusted or will be assigned to such a person; other information;"
  },
  {
    "type": "paragraph",
    "text": "to protect their rights and legitimate interests, including compensation for damages and/or) compensation for moral damage in court."
  },
  {
    "type": "paragraph",
    "text": "For residents of Brazil"
  },
  {
    "type": "paragraph",
    "text": "If Brazilian law applies to the processing of your Personal Data, you have the right to request from Maljoy:"
  },
  {
    "type": "paragraph",
    "text": "confirmation of the fact of data processing;"
  },
  {
    "type": "paragraph",
    "text": "access to processed data;"
  },
  {
    "type": "paragraph",
    "text": "correction of incomplete, inaccurate or outdated data;"
  },
  {
    "type": "paragraph",
    "text": "Anonymization, blocking or deletion of unnecessary, redundant data or data processed in violation of the provisions of the Brazilian Data Protection Act (LGPD);"
  },
  {
    "type": "paragraph",
    "text": "the possibility of transferring data to another service or product provider through a direct request in accordance with the requirements of the National Data protection Authority (ANPD) and taking into account the requirements of commercial and industrial secrets;"
  },
  {
    "type": "paragraph",
    "text": "deletion of personal data processed with your consent;"
  },
  {
    "type": "paragraph",
    "text": "information about public and private organizations with which Maljoy has shared data;"
  },
  {
    "type": "paragraph",
    "text": "information about the possibility of refusal of consent and the consequences of such refusal."
  },
  {
    "type": "paragraph",
    "text": "You can also withdraw your consent to the processing of Personal Data, object to the processing carried out on the basis of one of the situations of refusal of consent, if there is a violation of the provisions of the LGPD. We do not make decisions based solely on automated processing of Personal Data, however, in any case you have the right to review decisions made solely on the basis of automated processing of personal data affecting your interests, including decisions aimed at determining your personal, professional, consumer and credit profile or other aspects of your personality."
  },
  {
    "type": "paragraph",
    "text": "For residents of Indonesia"
  },
  {
    "type": "paragraph",
    "text": "If you are a resident of Indonesia, Law No. 27 of 2022 on Personal Data Protection (Undang-Undang Pelindungan Data Pribadi, or “UUPK” — referred to here as “UUPK” or “UU PDP”), which entered into full effect in October 2024, grants you the following rights in relation to your personal data that we process:"
  },
  {
    "type": "paragraph",
    "text": "Right of access (Article 34 UU PDP). You have the right to request confirmation of whether we process personal data about you, and if so, to obtain access to that data, including information about the purposes of processing, the categories of data processed, and the recipients to whom your data has been or may be disclosed."
  },
  {
    "type": "paragraph",
    "text": "Right to rectification (Article 35 UU PDP). You have the right to request the correction of inaccurate or incomplete personal data about you without undue delay."
  },
  {
    "type": "paragraph",
    "text": "Right to termination of processing and deletion (Article 36 UU PDP). You have the right to request that we stop processing and delete your personal data where: (i) the personal data is no longer necessary for the purposes for which it was collected; (ii) you have withdrawn consent, and no other lawful basis applies; (iii) you have successfully objected to the processing; or (iv) the processing is unlawful."
  },
  {
    "type": "paragraph",
    "text": "Right to withdraw consent (Article 38 UU PDP). Where we process your personal data based on your consent, you have the right to withdraw that consent at any time. Withdrawal of consent does not affect the lawfulness of processing carried out before withdrawal."
  },
  {
    "type": "paragraph",
    "text": "Right to object to automated processing (Article 40 UU PDP). You have the right not to be subject to a decision based solely on automated processing, including profiling, which produces legal or similarly significant effects on you. Where such processing occurs, you have the right to request human review of the decision."
  },
  {
    "type": "paragraph",
    "text": "Right to delay or restrict processing (Article 37 UU PDP). You have the right to request a temporary suspension of the processing of your personal data while a dispute regarding the accuracy of your data, or the lawfulness of our processing, is being resolved."
  },
  {
    "type": "paragraph",
    "text": "Right to data portability (Article 39 UU PDP). Where technically feasible, you have the right to receive a copy of the personal data you have provided to us in a structured, commonly used, and machine-readable format, and to request that we transmit that data to another controller."
  },
  {
    "type": "paragraph",
    "text": "Right to seek compensation (Article 67 UU PDP). You have the right to seek compensation or other redress through civil proceedings if you suffer material or non-material harm arising from our failure to comply with UU PDP."
  },
  {
    "type": "paragraph",
    "text": "For residents of India"
  },
  {
    "type": "paragraph",
    "text": "If you are located in India, the Digital Personal Data Protection Act, 2023 (“DPDPA”) grants you the following rights as a Data Principal in relation to your personal data that we process as a Data Fiduciary:"
  },
  {
    "type": "paragraph",
    "text": "Right to access information about processing (Section 11 DPDPA). You have the right to request the following information from us: (i) a summary of the personal data we hold about you and the ways in which it has been processed; (ii) the identities of all Data Fiduciaries and Data Processors with whom we have shared your personal data, and a description of the personal data shared; and (iii) any other information as may be prescribed by the Central Government. We will provide this information within a reasonable period of receiving your request."
  },
  {
    "type": "paragraph",
    "text": "Right to correction, completion, updating, and erasure (Section 12 DPDPA). You have the right to request that we: (i) correct inaccurate or misleading personal data; (ii) complete incomplete personal data; (iii) update personal data that is out of date; and (iv) erase personal data that is no longer necessary for the purpose for which it was collected, or where you have withdrawn consent and no other lawful basis applies. We will action valid requests within a reasonable period."
  },
  {
    "type": "paragraph",
    "text": "Right to withdraw consent (Section 6(4) DPDPA). Where we process your personal data on the basis of your consent, you may withdraw that consent at any time. Withdrawal of consent is as easy as giving consent. After withdrawal, we will cease processing your personal data unless another lawful basis under the DPDPA applies. Withdrawal of consent does not affect the lawfulness of processing carried out before the withdrawal."
  },
  {
    "type": "paragraph",
    "text": "Right to grievance redressal (Section 13 DPDPA). You have the right to have your grievances regarding our processing of your personal data addressed promptly. If you are not satisfied with our response, you may escalate your complaint to the Data Protection Board of India (see below)."
  },
  {
    "type": "paragraph",
    "text": "Right to nominate (Section 14 DPDPA). You have the right to nominate any other individual to exercise your data rights in the event of your death or incapacity. To register or update your nomination, please contact us at privacy@maljoy.io."
  },
  {
    "type": "paragraph",
    "text": "Children’s personal data (Section 9 DPDPA). We do not knowingly process the personal data of children (persons under 18 years of age) without obtaining verifiable consent from their parent or lawful guardian. We also do not engage in the tracking or behavioural monitoring of children, or target advertising at children, through the Service. If you are the parent or guardian of a child and believe we may have processed your child’s personal data without appropriate consent, please contact us immediately at privacy@maljoy.io."
  },
  {
    "type": "paragraph",
    "text": "How to exercise your rights. To exercise any of the rights listed above, please contact us at privacy@maljoy.io. We will respond to your request within a reasonable period and, in any event, within thirty (30) days. We may need to verify your identity before processing your request."
  },
  {
    "type": "paragraph",
    "text": "For residents of the Republic of Turkey"
  },
  {
    "type": "paragraph",
    "text": "The Personal Data Protection Act No. 6698 (“DPL”) contains the rights of data subjects accessing services from the Republic of Turkey. You have the right to contact the data controller in order to:"
  },
  {
    "type": "paragraph",
    "text": "find out if your personal data is being processed;"
  },
  {
    "type": "paragraph",
    "text": "request information about whether your personal data has been processed;"
  },
  {
    "type": "paragraph",
    "text": "find out the purpose of processing your personal data and whether this personal data is used in accordance with the purpose;"
  },
  {
    "type": "paragraph",
    "text": "know the third parties to whom your personal data is transferred in the country or abroad;"
  },
  {
    "type": "paragraph",
    "text": "request correction of incomplete or inaccurate data, if any;"
  },
  {
    "type": "paragraph",
    "text": "request the deletion of your personal data in accordance with the conditions specified in Article 7 of the DPL;"
  },
  {
    "type": "paragraph",
    "text": "request reporting on transactions carried out in certain cases from third parties to whom your personal data has been transferred;"
  },
  {
    "type": "paragraph",
    "text": "independently object to the occurrence of a result in relation to this person by analysing data processed exclusively using automated systems;"
  },
  {
    "type": "paragraph",
    "text": "claim compensation for damages resulting from the illegal processing of your personal data."
  },
  {
    "type": "paragraph",
    "text": "To exercise his/her rights or for privacy questions, the User can contact: privacy@maljoy.io."
  },
  {
    "type": "paragraph",
    "text": "Contact the data protection authorities"
  },
  {
    "type": "paragraph",
    "text": "For residents of the European Union: If you live in the European Union and believe that we are illegally processing your personal data, you have the right to file a complaint with the local data protection supervisory authority. You can find contact information here: https://www.edpb.europa.eu/about-edpb/about-edpb/members_en."
  },
  {
    "type": "paragraph",
    "text": "For residents of the Russian Federation: if you believe that your rights are being violated, you can contact the Authorized Body for the Protection of the rights of personal data subjects – Federal Service for Supervision of Communications. You can find contact information at: https://rkn.gov.ru/contacts /."
  },
  {
    "type": "paragraph",
    "text": "For residents of Brazil: if you believe that our interaction with your personal data violates applicable law, you can send a corresponding request to the Brazilian Data Protection Authority (ANPD)."
  },
  {
    "type": "paragraph",
    "text": "For residents of Indonesia: If you are located in Indonesia and believe that our processing of your personal data violates UU PDP or other applicable Indonesian law, you have the right to lodge a complaint with the competent supervisory authority. Until the dedicated Personal Data Protection Authority (Lembaga Pelindungan Data Pribadi) referred to in Article 58 of UU PDP has been formally constituted and made operational by the Indonesian Government, complaints regarding personal data processing may be directed to the Ministry of Communication and Digital Affairs (Kementerian Komunikasi dan Digital, “Komdigi”), formerly the Ministry of Communication and Information Technology (Kominfo): https://komdigi.go.id. Complaints portal: https://aduankonten.id"
  },
  {
    "type": "paragraph",
    "text": "For residents of India: If you are located in India and believe that our processing of your personal data violates the DPDPA or other applicable Indian data protection law, you have the right to lodge a complaint with the Data Protection Board of India (https://dpboard.gov.in). Under Section 13(2) of the DPDPA, before lodging a complaint with the DPBI, a Data Principal must first allow the Data Fiduciary to resolve the grievance."
  },
  {
    "type": "paragraph",
    "text": "Accordingly, we encourage you to contact us first at privacy@maljoy.io so that we can attempt to resolve your concern directly. If you are not satisfied with our response, you may then escalate the complaint to the DPBI."
  },
  {
    "type": "paragraph",
    "text": "For residents of the Republic of Turkey: if you believe that your rights are being violated, you can contact the Office for Personal Data Protection. You can find contact information here: https://www.kvkk.gov.tr/Icerik/6655/Contact-Us."
  },
  {
    "type": "paragraph",
    "text": "Is my personal data sold to any third parties?"
  },
  {
    "type": "paragraph",
    "text": "No, we do not sell the personal data of Bot users to any third parties and have never attempted to sell any personal data."
  },
  {
    "type": "paragraph",
    "text": "Changes to this Privacy Policy"
  },
  {
    "type": "paragraph",
    "text": "We’ll do our best to communicate the changes to this Privacy Policy through the Bot or Service. However, we encourage you to review this Privacy Policy periodically to stay aware of the most recent version. Your continued use of the Bot or Service after any modifications thereto constitutes acceptance of the updated Privacy Policy."
  },
  {
    "type": "paragraph",
    "text": "With warm regards,"
  },
  {
    "type": "paragraph",
    "text": "MALJOY Team"
  }
];
